MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV08KM202/mcu.h
extern volatile AD1CSSLBITS AD1CSSLbits __attribute__((__sfr__));

#define AD1CON5 AD1CON5
extern volatile uint16_t AD1CON5 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON5BITS {
  union {
    struct {
      uint16_t CM:2;
      uint16_t WM:2;
      uint16_t :4;
      uint16_t ASINT:2;
      uint16_t :2;
      uint16_t BGREQ:1;
      uint16_t CTMREQ:1;
      uint16_t LPEN:1;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t :4;
      uint16_t ASINT0:1;
      uint16_t ASINT1:1;
    };
  };
} AD1CON5BITS;
extern volatile AD1CON5BITS AD1CON5bits __attribute__((__sfr__));

#define AD1CHITH AD1CHITH
extern volatile uint16_t AD1CHITH __attribute__((__sfr__));
typedef struct tagAD1CHITHBITS {
  uint16_t CHH16:1;
  uint16_t CHH17:1;
  uint16_t CHH18:1;
  uint16_t CHH19:1;
  uint16_t CHH20:1;
  uint16_t CHH21:1;
  uint16_t CHH22:1;
  uint16_t CHH23:1;
} AD1CHITHBITS;
extern volatile AD1CHITHBITS AD1CHITHbits __attribute__((__sfr__));

#define AD1CHITL AD1CHITL
extern volatile uint16_t AD1CHITL __attribute__((__sfr__));
typedef struct tagAD1CHITLBITS {
  uint16_t CHH0:1;
  uint16_t CHH1:1;
  uint16_t CHH2:1;
  uint16_t CHH3:1;
  uint16_t CHH4:1;
  uint16_t CHH5:1;
  uint16_t :3;
  uint16_t CHH9:1;
  uint16_t CHH10:1;
  uint16_t CHH11:1;
  uint16_t CHH12:1;
  uint16_t CHH13:1;
  uint16_t CHH14:1;
  uint16_t CHH15:1;
} AD1CHITLBITS;
extern volatile AD1CHITLBITS AD1CHITLbits __attribute__((__sfr__));

#define CTMUCON1L CTMUCON1L
extern volatile uint16_t CTMUCON1L __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON1LBITS {
  union {
    struct {
      uint16_t IRNG:2;
      uint16_t ITRIM:6;
      uint16_t CTTRIG:1;
      uint16_t IDISSEN:1;
      uint16_t EDGSEQEN:1;
      uint16_t EDGEN:1;
      uint16_t TGEN:1;
      uint16_t CTMUSIDL:1;
      uint16_t :1;
      uint16_t CTMUEN:1;
    };
    struct {
      uint16_t IRNG0:1;
      uint16_t IRNG1:1;
      uint16_t ITRIM0:1;
      uint16_t ITRIM1:1;
      uint16_t ITRIM2:1;
      uint16_t ITRIM3:1;
      uint16_t ITRIM4:1;
      uint16_t ITRIM5:1;
    };
  };
} CTMUCON1LBITS;
extern volatile CTMUCON1LBITS CTMUCON1Lbits __attribute__((__sfr__));

#define CTMUCON1H CTMUCON1H
extern volatile uint16_t CTMUCON1H __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON1HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t EDG2SEL:4;
      uint16_t EDG2POL:1;
      uint16_t EDG2MOD:1;
      uint16_t EDG1STAT:1;
      uint16_t EDG2STAT:1;
      uint16_t EDG1SEL:4;
      uint16_t EDG1POL:1;
      uint16_t EDG1MOD:1;
    };
    struct {
      uint16_t :2;
      uint16_t EDG2SEL0:1;
      uint16_t EDG2SEL1:1;
      uint16_t EDG2SEL2:1;
      uint16_t EDG2SEL3:1;
      uint16_t :4;
      uint16_t EDG1SEL0:1;
      uint16_t EDG1SEL1:1;
      uint16_t EDG1SEL2:1;
      uint16_t EDG1SEL3:1;
    };
  };
} CTMUCON1HBITS;
extern volatile CTMUCON1HBITS CTMUCON1Hbits __attribute__((__sfr__));

#define CTMUCON2 CTMUCON2
extern volatile uint16_t CTMUCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON2BITS {
  union {
    struct {
      uint16_t DISCHS:3;
      uint16_t :1;
      uint16_t IRSTEN:1;
    };
    struct {
      uint16_t DISCHS0:1;
      uint16_t DISCHS1:1;
      uint16_t DISCHS2:1;
    };
  };
} CTMUCON2BITS;
extern volatile CTMUCON2BITS CTMUCON2bits __attribute__((__sfr__));

#define CTMUCON2L CTMUCON2L
extern volatile uint16_t CTMUCON2L __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON2LBITS {
  union {
    struct {
      uint16_t DISCHS:3;
      uint16_t :1;
      uint16_t IRSTEN:1;
    };
    struct {
      uint16_t DISCHS0:1;
      uint16_t DISCHS1:1;
      uint16_t DISCHS2:1;
    };
  };
} CTMUCON2LBITS;
extern volatile CTMUCON2LBITS CTMUCON2Lbits __attribute__((__sfr__));

#define AD1CTMENH AD1CTMENH
extern volatile uint16_t AD1CTMENH __attribute__((__sfr__));
typedef struct tagAD1CTMENHBITS {
  uint16_t CTMEN16:1;
  uint16_t CTMEN17:1;
  uint16_t CTMEN18:1;
  uint16_t CTMEN19:1;
  uint16_t CTMEN20:1;
  uint16_t CTMEN21:1;
  uint16_t CTMEN22:1;
  uint16_t CTMEN23:1;
} AD1CTMENHBITS;
extern volatile AD1CTMENHBITS AD1CTMENHbits __attribute__((__sfr__));

#define AD1CTMENL AD1CTMENL
extern volatile uint16_t AD1CTMENL __attribute__((__sfr__));
typedef struct tagAD1CTMENLBITS {
  uint16_t CTMEN0:1;
  uint16_t CTMEN1:1;
  uint16_t CTMEN2:1;
  uint16_t CTMEN3:1;
  uint16_t CTMEN4:1;
  uint16_t CTMEN5:1;
  uint16_t :3;
  uint16_t CTMEN9:1;
  uint16_t CTMEN10:1;
  uint16_t CTMEN11:1;
  uint16_t CTMEN12:1;
  uint16_t CTMEN13:1;
  uint16_t CTMEN14:1;
  uint16_t CTMEN15:1;
} AD1CTMENLBITS;
extern volatile AD1CTMENLBITS AD1CTMENLbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
__extension__ typedef struct tagANSABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
      uint16_t ANSA4:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
      uint16_t ANSELA4:1;
    };
  };
} ANSABITS;
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
__extension__ typedef struct tagANSELABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
      uint16_t ANSA4:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
      uint16_t ANSELA4:1;
    };
  };
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t :2;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t :2;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t :2;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t :2;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define ALRMVAL ALRMVAL
extern volatile uint16_t ALRMVAL __attribute__((__sfr__));
#define ALCFGRPT ALCFGRPT
extern volatile uint16_t ALCFGRPT __attribute__((__sfr__));
__extension__ typedef struct tagALCFGRPTBITS {
  union {
    struct {
      uint16_t ARPT:8;
      uint16_t ALRMPTR:2;
      uint16_t AMASK:4;
      uint16_t CHIME:1;
      uint16_t ALRMEN:1;
    };
    struct {
      uint16_t ARPT0:1;
      uint16_t ARPT1:1;
      uint16_t ARPT2:1;
      uint16_t ARPT3:1;
      uint16_t ARPT4:1;
      uint16_t ARPT5:1;
      uint16_t ARPT6:1;
      uint16_t ARPT7:1;
      uint16_t ALRMPTR0:1;
      uint16_t ALRMPTR1:1;
      uint16_t AMASK0:1;
      uint16_t AMASK1:1;
      uint16_t AMASK2:1;
      uint16_t AMASK3:1;
    };
  };
} ALCFGRPTBITS;
extern volatile ALCFGRPTBITS ALCFGRPTbits __attribute__((__sfr__));

#define RTCVAL RTCVAL
extern volatile uint16_t RTCVAL __attribute__((__sfr__));
#define RCFGCAL RCFGCAL
extern volatile uint16_t RCFGCAL __attribute__((__sfr__));
__extension__ typedef struct tagRCFGCALBITS {
  union {
    struct {
      uint16_t CAL:8;
      uint16_t RTCPTR:2;
      uint16_t RTCOE:1;
      uint16_t HALFSEC:1;
      uint16_t RTCSYNC:1;
      uint16_t RTCWREN:1;
      uint16_t :1;
      uint16_t RTCEN:1;
    };
    struct {
      uint16_t CAL0:1;
      uint16_t CAL1:1;
      uint16_t CAL2:1;
      uint16_t CAL3:1;
      uint16_t CAL4:1;
      uint16_t CAL5:1;
      uint16_t CAL6:1;
      uint16_t CAL7:1;
      uint16_t RTCPTR0:1;
      uint16_t RTCPTR1:1;
    };
  };
} RCFGCALBITS;
extern volatile RCFGCALBITS RCFGCALbits __attribute__((__sfr__));

#define RTCPWC RTCPWC
extern volatile uint16_t RTCPWC __attribute__((__sfr__));
__extension__ typedef struct tagRTCPWCBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t RTCOUT:2;
      uint16_t RTCLK:2;
      uint16_t PWSPRE:1;
      uint16_t PWCPRE:1;
      uint16_t PWCPOL:1;
      uint16_t PWCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t RTCOUT0:1;
      uint16_t RTCOUT1:1;
      uint16_t RTCLK0:1;
      uint16_t RTCLK1:1;
      uint16_t PWCSPRE:1;
      uint16_t PWCCPRE:1;
    };
    struct {
      uint16_t :10;
      uint16_t RTCCLK:2;
    };
    struct {
      uint16_t :10;
      uint16_t RTCCLK0:1;
      uint16_t RTCCLK1:1;
    };
  };
} RTCPWCBITS;
extern volatile RTCPWCBITS RTCPWCbits __attribute__((__sfr__));

#define CMSTAT CMSTAT
extern volatile uint16_t CMSTAT __attribute__((__sfr__));
typedef struct tagCMSTATBITS {
  uint16_t C1OUT:1;
  uint16_t C2OUT:1;
  uint16_t C3OUT:1;
  uint16_t :5;
  uint16_t C1EVT:1;
  uint16_t C2EVT:1;
  uint16_t C3EVT:1;
  uint16_t :4;
  uint16_t CMIDL:1;
} CMSTATBITS;
extern volatile CMSTATBITS CMSTATbits __attribute__((__sfr__));

#define CVRCON CVRCON
extern volatile uint16_t CVRCON __attribute__((__sfr__));
__extension__ typedef struct tagCVRCONBITS {
  union {
    struct {
      uint16_t CVR:5;
      uint16_t CVRSS:1;
      uint16_t CVROE:1;
      uint16_t CVREN:1;
    };
    struct {
      uint16_t CVR0:1;
      uint16_t CVR1:1;
      uint16_t CVR2:1;
      uint16_t CVR3:1;
      uint16_t CVR4:1;
    };
  };
} CVRCONBITS;
extern volatile CVRCONBITS CVRCONbits __attribute__((__sfr__));

#define CM1CON CM1CON
extern volatile uint16_t CM1CON __attribute__((__sfr__));
__extension__ typedef struct tagCM1CONBITS {
  union {
    struct {
      uint16_t CCH:2;
      uint16_t :2;
      uint16_t CREF:2;
      uint16_t EVPOL:2;
      uint16_t COUT:1;
      uint16_t CEVT:1;
      uint16_t :2;
      uint16_t CLPWR:1;
      uint16_t CPOL:1;
      uint16_t COE:1;
      uint16_t CON:1;
    };
    struct {
      uint16_t CCH0:1;
      uint16_t CCH1:1;
      uint16_t :2;
      uint16_t CREF0:1;
      uint16_t CREF1:1;
      uint16_t EVPOL0:1;
      uint16_t EVPOL1:1;
    };
  };
} CM1CONBITS;
extern volatile CM1CONBITS CM1CONbits __attribute__((__sfr__));

