MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV08KM202/mcu.h
/* CCP3CON2H */
/* Bitname _ICS cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM cannot be defined because it is used by more than one SFR */
/* Bitname _OCAEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCBEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCCEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCDEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCEEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCFEN cannot be defined because it is used by more than one SFR */
/* Bitname _OENSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ICS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL2 cannot be defined because it is used by more than one SFR */

/* CCP3CON3L */
/* Bitname _DT cannot be defined because it is used by more than one SFR */
/* Bitname _DT0 cannot be defined because it is used by more than one SFR */
/* Bitname _DT1 cannot be defined because it is used by more than one SFR */
/* Bitname _DT2 cannot be defined because it is used by more than one SFR */
/* Bitname _DT3 cannot be defined because it is used by more than one SFR */
/* Bitname _DT4 cannot be defined because it is used by more than one SFR */
/* Bitname _DT5 cannot be defined because it is used by more than one SFR */

/* CCP3CON3H */
/* Bitname _PSSBDF cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE cannot be defined because it is used by more than one SFR */
/* Bitname _POLBDF cannot be defined because it is used by more than one SFR */
/* Bitname _POLACE cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT cannot be defined because it is used by more than one SFR */
/* Bitname _OETRIG cannot be defined because it is used by more than one SFR */
/* Bitname _PSSBDF0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSBDF1 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT2 cannot be defined because it is used by more than one SFR */

/* CCP3STAT */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP3STATL */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP4CON1L */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TMRSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _CCPON cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMR32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD3 cannot be defined because it is used by more than one SFR */

/* CCP4CON1H */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ALTSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ONESHOT cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPS cannot be defined because it is used by more than one SFR */
/* Bitname _RTRGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPSSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC4 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _OPSRC cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS3 cannot be defined because it is used by more than one SFR */

/* CCP4CON2L */
/* Bitname _ASDG cannot be defined because it is used by more than one SFR */
/* Bitname _SSDG cannot be defined because it is used by more than one SFR */
/* Bitname _ASDGM cannot be defined because it is used by more than one SFR */
/* Bitname _PWMRSEN cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG0 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG1 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG2 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG3 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG4 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG5 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG6 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG7 cannot be defined because it is used by more than one SFR */

/* CCP4CON2H */
/* Bitname _ICS cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM cannot be defined because it is used by more than one SFR */
/* Bitname _OCAEN cannot be defined because it is used by more than one SFR */
/* Bitname _OENSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ICS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL2 cannot be defined because it is used by more than one SFR */

/* CCP4CON3H */
/* Bitname _PSSACE cannot be defined because it is used by more than one SFR */
/* Bitname _POLACE cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT cannot be defined because it is used by more than one SFR */
/* Bitname _OETRIG cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT2 cannot be defined because it is used by more than one SFR */

